# GetEndTreatmentTypeId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShape..::..GetEndTreatmentTypeId Method
RebarShape Class See Also
---
Gets the id of the EndTreatmentType at the specified rebar shape end.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ElementId GetEndTreatmentTypeId(
	int iEnd
)
```

Visual Basic
---
```text
Public Function GetEndTreatmentTypeId ( _
	iEnd As Integer _
) As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetEndTreatmentTypeId(
	int iEnd
)
```

# ### Parameters
iEnd
    Type: System..::..Int32 0 for the start end treatment, 1 for the end end treatment.
# ### Return Value
Returns the id of an EndTreatmentType, or invalidElementId if the rebar shape has no end treatment at the specified end.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | iEnd not a valid shape end |

# See Also
RebarShape Class
Autodesk.Revit.DB.Structure Namespace